nhom_10/ThanhNC-Nhom10-ShoppingCartOnline/app/controllers/products_controller.rb

INSERT INTO "products" ("category", "created_at", "detail", "name", "price", "pro_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category", 0], ["created_at", Thu, 28 Jun 2012 06:07:45 UTC +00:00], ["detail", "dad"], ["name", "dad"], ["price", 1.0], ["pro_id", 1], ["updated_at", Thu, 28 Jun 2012 06:07:45 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])
    if @product.save

SELECT "products".* FROM "products" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.paginate(page: params[:page])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "products" SET "category" = 0, "updated_at" = '2012-06-28 09:37:28.319465' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])