nhom_10/ThanhNC-Nhom10-ShoppingCartOnline/app/controllers/static_pages_controller.rb

SELECT "products".* FROM "products" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def home
      @feed_items = Product.paginate(page: params[:page])