nhom_10/ThanhNC-Nhom10-ShoppingCartOnline/app/controllers/users_controller.rb

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_digest" = '$2a$10$ucu0xK.ShvfEYdIewbyWo.cMZUj6Kx8L3syGAo7FLxrs4vCstk7x.', "remember_token" = 'uHC4ev9LiGCdaqmeKUj-_A', "updated_at" = '2012-06-25 02:24:47.260836' WHERE "users"."id" = 1

  def destroy
    @admin = User.find(params[:id])
    if @admin == current_user
      flash[:success] = "Cannot delete Admin."
      redirect_to root_path
    else
      @admin.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]